RU = {
    "start": ("""
🎮 Узнайте, в каком регионе игру выгоднее покупать.

<b>1.</b> Выберите до <b>5 регионов</b> для сравнения.
<b>2.</b> Найдите игру через поиск.
<b>3.</b> Получите результат.
"""),
    "help": ("""
🎮 <b>О боте</b>
Бот сравнивает цены на игры в PlayStation Store разных регионов.

Выберите интересующие вас регионы, найдите нужную игру через поиск — и бот покажет цены в выбранной валюте. Это позволяет быстро сравнить стоимость игры и выбрать наиболее выгодный регион.

🌍 <b>Регионы</b>
В меню можно выбрать регионы PlayStation Store, которые будут учитываться при сравнении цен.

💱 <b>Валюта</b>
В /menu можно выбрать удобную валюту для отображения цен. Бот автоматически конвертирует стоимость игр для удобного сравнения.

🌐 <b>Язык</b>
You can change the language in the /menu.
Язык интерфейса также можно изменить в /menu.

⚙️ <b>Меню</b>
Используйте команду /menu, чтобы изменить язык, валюту и выбранные регионы.

🐞 <b>Нашли ошибку?</b>
Если вы заметили баг, неточность в цене или у вас есть идея, как улучшить бота, напишите мне:
@region_ps

💻 <b>Нужен похожий бот?</b>
Если вам нужен Telegram-бот под ваши задачи — можете также обратиться ко мне.

💙 Если бот оказался полезным, можете просто сказать спасибо или купить мне кофе ☕️. Это поможет поддержать проект.
"""),
    "menu": "🎮 Главное Меню:",
    "back:menu": "⬅️ Главное Меню",

    "find a game": "🔍 Найти игру",
    "wait": "⏳ Ожидайте...",
    "error": "❌ Не удалось получить информацию о ценах.",
    "inline_description": "Playstation Store",

    "included": "Включено",
    "ps+": "PS+",
    "price_ps+": "Цена",
    "price_full": "Полная",
    "price_original": "Оригинальная",

    "regions": "🌍 Регионы",
    "regions_select": "Выберите регионы:",
    "region_removed": "Убран регион",
    "region_added": "Добавлен регион",
    "max_regions": "🛑 Достигнут лимит",
    "no_region": "Вы не выбрали регионы для поиска цен.\n\nВыберите регионы в /menu",

    "language": "🗣 Язык / Language",

    "currency": "💰 Ваша валюта",
    "currency_select": "Выберите валюту:",
    "currency_chosen": "Текущая валюта",
    "REGION_GROUPS": {
        "🇦🇷 Argentina": "Америка",
        "🇦🇹 Austria": "Европа",
        "🇧🇭 Bahrain": "Ближний Восток, Африка",
        "🇨🇾 Cyprus": "Азия и Океания",
    }
}
